import myRecommend1 from "images/MyRecommend-1.jpg";
import myRecommend2 from "images/MyRecommend-2.jpg";
import myRecommend3 from "images/MyRecommend-3.jpg";

export const cardGroup = [
  {
    id: 1,
    image: myRecommend1,
    title: "BODY RECORD",
    description: "自分のカラダの記録",
  },
  {
    id: 2,
    image: myRecommend2,
    title: "MY EXERCISE",
    description: "自分の運動の記録",
  },
  {
    id: 3,
    image: myRecommend3,
    title: "MY DIARY",
    description: "自分の日記",
  },
];

export const dataGraphMyRecord: DataGraph = {
  labels: [
    "6月",
    "7月",
    "8月",
    "9月",
    "10月",
    "11月",
    "12月",
    "1月",
    "2月",
    "3月",
    "4月",
    "5月",
  ],
  datasets: [
    {
      label: "Dataset 1",
      data: [850, 780, 650, 600, 400, 390, 300, 280, 230, 150, 100, 50],
      borderColor: "#8FE9D0",
      backgroundColor: "#8FE9D0",
    },
    {
      label: "Dataset 2",
      data: [850, 800, 530, 670, 550, 450, 550, 350, 330, 250, 150, 80],
      borderColor: "#FFCC21",
      backgroundColor: "#FFCC21",
    },
  ],
};

export const listExercises = [
  {
    id: 1,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 2,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 3,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 4,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 5,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 6,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 7,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 8,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 9,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 10,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 11,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 12,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 13,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 14,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 15,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 16,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 17,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 18,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 19,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 20,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 21,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 22,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 23,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 24,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 25,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 26,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 27,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 28,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 29,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 30,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 31,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 32,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 33,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 34,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 35,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 36,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 37,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
  {
    id: 38,
    content: "家事全般（立位・軽い）",
    kcal: 26,
    time: 10,
  },
];

export const listDiaries = [
  {
    id: 1,
    date: "2022-05-21T16:25:18.084Z",
    text: "テキストテキストテキストテキストキスストテキスストキストテキスストキストテストテキステキストキストテキストテキステキストキストテキストテキステキストキストテキストテキステキスキステキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキス",
  },
  {
    id: 2,
    date: "2022-05-21T16:25:18.084Z",
    text: "テキストテキストテキストテキストキスストテキスストキストテキスストキストテストテキステキストキストテキストテキステキストキストテキストテキステキストキストテキストテキステキスキステキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキス",
  },
  {
    id: 3,
    date: "2022-05-21T16:25:18.084Z",
    text: "テキストテキストテキストテキストキスストテキスストキストテキスストキストテストテキステキストキストテキストテキステキストキストテキストテキステキストキストテキストテキステキスキステキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキス",
  },
  {
    id: 4,
    date: "2022-05-21T16:25:18.084Z",
    text: "テキストテキストテキストテキストキスストテキスストキストテキスストキストテストテキステキストキストテキストテキステキストキストテキストテキステキストキストテキストテキステキスキステキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキス",
  },
  {
    id: 5,
    date: "2022-05-21T16:25:18.084Z",
    text: "テキストテキストテキストテキストキスストテキスストキストテキスストキストテストテキステキストキストテキストテキステキストキストテキストテキステキストキストテキストテキステキスキステキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキス",
  },
  {
    id: 6,
    date: "2022-05-21T16:25:18.084Z",
    text: "テキストテキストテキストテキストキスストテキスストキストテキスストキストテストテキステキストキストテキストテキステキストキストテキストテキステキストキストテキストテキステキスキステキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキス",
  },
  {
    id: 7,
    date: "2022-05-21T16:25:18.084Z",
    text: "テキストテキストテキストテキストキスストテキスストキストテキスストキストテストテキステキストキストテキストテキステキストキストテキストテキステキストキストテキストテキステキスキステキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキス",
  },
  {
    id: 8,
    date: "2022-05-21T16:25:18.084Z",
    text: "テキストテキストテキストテキストキスストテキスストキストテキスストキストテストテキステキストキストテキストテキステキストキストテキストテキステキストキストテキストテキステキスキステキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキス",
  },
];
